src/main/resources/wsdl/helloWorld.wsdl

<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://service.demo.com/"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http"
	name="IHelloWorldService" targetNamespace="http://service.demo.com/">
	<wsdl:message name="sayHelloResponse">
		<wsdl:part name="return" type="xsd:string"></wsdl:part>
	</wsdl:message>
	<wsdl:message name="sayHello">
		<wsdl:part name="name" type="xsd:string"></wsdl:part>
	</wsdl:message>
	<wsdl:portType name="IHelloWorld">
		<wsdl:operation name="sayHello">
			<wsdl:input message="tns:sayHello" name="sayHello"></wsdl:input>
			<wsdl:output message="tns:sayHelloResponse" name="sayHelloResponse"></wsdl:output>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="IHelloWorldServiceSoapBinding" type="tns:IHelloWorld">
		<soap:binding style="rpc"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="sayHello">
			<soap:operation soapAction="" style="rpc" />
			<wsdl:input name="sayHello">
				<soap:body namespace="http://service.demo.com/" use="literal" />
			</wsdl:input>
			<wsdl:output name="sayHelloResponse">
				<soap:body namespace="http://service.demo.com/" use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="IHelloWorldService">
		<wsdl:port binding="tns:IHelloWorldServiceSoapBinding" name="IHelloWorldPort">
			<soap:address location="http://localhost:8080/webservice-demo/helloWorld" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>